name: "CUHK_Action_Temporal_1mean_9minus_Net"
layer {
  name: "flow_data"
  type: "VideoData"
  top: "flow_data"
  top: "label"
  video_data_param {
    source: "../../dataset_file_examples/train_flow_split1.txt"
    batch_size: 25
    new_length: 10
    num_segments: 1
    modality: FLOW
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios: [1,0.875,0.75]
    is_flow: true
    mean_value: [128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]
  }
  include: { phase: TRAIN }
}
layer {
  name: "flow_data"
  type: "VideoData"
  top: "flow_data"
  top: "label"
  video_data_param {
    source: "../../dataset_file_examples/val_flow_split1.txt"
    batch_size: 5
    new_length: 10
    num_segments: 1
    modality: FLOW
    
    full_test: false
    full_test_param {
      is_mirror: false
      is_crop: false
      full_test_num_segments: 100
      # in full test mode, you must set test_batch_size and batch_size is invalid
      test_batch_size: 5
    }
  }
  transform_param{
    crop_size: 224
    mirror: false
    is_flow: true
    mean_value: [128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]
  }
  include: { phase: TEST }
}

layer {
  name: "slicer"
  type: "Slice"
  bottom: "flow_data"
  top: "flow_data_p0"
  top: "flow_data_p1"
  top: "flow_data_p2"
  top: "flow_data_p3"
  top: "flow_data_p4"
  top: "flow_data_p5"
  top: "flow_data_p6"
  top: "flow_data_p7"
  top: "flow_data_p8"
  top: "flow_data_p9"
  slice_param {
    axis: 1
    slice_point: 2
    slice_point: 4
    slice_point: 6
    slice_point: 8
    slice_point: 10
    slice_point: 12
    slice_point: 14
    slice_point: 16
    slice_point: 18
  }
}

layer {
  name: "eltwise-sum0"
  type: "Eltwise"
  bottom: "flow_data_p0"
  bottom: "flow_data_p1"
  bottom: "flow_data_p2"
  bottom: "flow_data_p3"
  top: "flow_data_p0123"
  eltwise_param { 
    operation: SUM 
    coeff: [0.15, 0.35, 0.35, 0.15]
  }
}

layer {
  name: "eltwise-sum1"
  type: "Eltwise"
  bottom: "flow_data_p2"
  bottom: "flow_data_p3"
  bottom: "flow_data_p4"
  top: "flow_data_p234"
  eltwise_param { 
    operation: SUM 
    coeff: [0.25, 0.5, 0.25]
  }
}

layer {
  name: "eltwise-sum2"
  type: "Eltwise"
  bottom: "flow_data_p3"
  bottom: "flow_data_p4"
  bottom: "flow_data_p5"
  bottom: "flow_data_p6"
  top: "flow_data_p3456"
  eltwise_param { 
    operation: SUM 
    coeff: [0.15, 0.35, 0.35, 0.15]
  }
}

layer {
  name: "eltwise-sum3"
  type: "Eltwise"
  bottom: "flow_data_p5"
  bottom: "flow_data_p6"
  bottom: "flow_data_p7"
  top: "flow_data_p567"
  eltwise_param { 
    operation: SUM 
    coeff: [0.25, 0.5, 0.25]
  }
}

layer {
  name: "eltwise-sum4"
  type: "Eltwise"
  bottom: "flow_data_p6"
  bottom: "flow_data_p7"
  bottom: "flow_data_p8"
  bottom: "flow_data_p9"
  top: "flow_data_p6789"
  eltwise_param { 
    operation: SUM 
    coeff: [0.15, 0.35, 0.35, 0.15]
  }
}

layer {
  name: "eltwise-sum5"
  type: "Eltwise"
  bottom: "flow_data_p0"
  bottom: "flow_data_p1"
  top: "flow_data_pm01"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "eltwise-sum6"
  type: "Eltwise"
  bottom: "flow_data_p2"
  bottom: "flow_data_p3"
  top: "flow_data_pm23"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "eltwise-sum7"
  type: "Eltwise"
  bottom: "flow_data_p4"
  bottom: "flow_data_p5"
  top: "flow_data_pm45"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "eltwise-sum8"
  type: "Eltwise"
  bottom: "flow_data_p6"
  bottom: "flow_data_p7"
  top: "flow_data_pm67"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "eltwise-sum9"
  type: "Eltwise"
  bottom: "flow_data_p8"
  bottom: "flow_data_p9"
  top: "flow_data_pm89"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "eltwise-sum10"
  type: "Eltwise"
  bottom: "flow_data_p567"
  bottom: "flow_data_p234"
  top: "flow_data_pms"
  eltwise_param { 
    operation: SUM 
    coeff: [-0.5, 0.5]
  }
}

layer {
  name: "concat_flow_data"
  bottom: "flow_data_p0123"
  bottom: "flow_data_p234"
  bottom: "flow_data_p3456"
  bottom: "flow_data_p567"
  bottom: "flow_data_p6789"
  bottom: "flow_data_pm01"
  bottom: "flow_data_pm23"
  bottom: "flow_data_pm45"
  bottom: "flow_data_pm67"
  bottom: "flow_data_pm89"
  bottom: "flow_data_pms"
  top: "flow_data_combine"
  type: "Concat"
  concat_param {
    axis: 1
  }
}


layer {
  name: "flow_conv1_1"
  type: "Convolution"
  bottom: "flow_data_combine"
  top: "flow_conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
  # attention
  propagate_down: false
}
layer {
  name: "flow_relu1_1"
  type: "ReLU"
  bottom: "flow_conv1_1"
  top: "flow_conv1_1"
}
layer {
  name: "flow_conv1_2"
  type: "Convolution"
  bottom: "flow_conv1_1"
  top: "flow_conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu1_2"
  type: "ReLU"
  bottom: "flow_conv1_2"
  top: "flow_conv1_2"
}
layer {
  name: "flow_pool1"
  type: "Pooling"
  bottom: "flow_conv1_2"
  top: "flow_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "flow_conv2_1"
  type: "Convolution"
  bottom: "flow_pool1"
  top: "flow_conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu2_1"
  type: "ReLU"
  bottom: "flow_conv2_1"
  top: "flow_conv2_1"
}
layer {
  name: "flow_conv2_2"
  type: "Convolution"
  bottom: "flow_conv2_1"
  top: "flow_conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu2_2"
  type: "ReLU"
  bottom: "flow_conv2_2"
  top: "flow_conv2_2"
}
layer {
  name: "flow_pool2"
  type: "Pooling"
  bottom: "flow_conv2_2"
  top: "flow_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "flow_conv3_1"
  type: "Convolution"
  bottom: "flow_pool2"
  top: "flow_conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu3_1"
  type: "ReLU"
  bottom: "flow_conv3_1"
  top: "flow_conv3_1"
}
layer {
  name: "flow_conv3_2"
  type: "Convolution"
  bottom: "flow_conv3_1"
  top: "flow_conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu3_2"
  type: "ReLU"
  bottom: "flow_conv3_2"
  top: "flow_conv3_2"
}
layer {
  name: "flow_conv3_3"
  type: "Convolution"
  bottom: "flow_conv3_2"
  top: "flow_conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu3_3"
  type: "ReLU"
  bottom: "flow_conv3_3"
  top: "flow_conv3_3"
}
layer {
  name: "flow_pool3"
  type: "Pooling"
  bottom: "flow_conv3_3"
  top: "flow_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "flow_conv4_1"
  type: "Convolution"
  bottom: "flow_pool3"
  top: "flow_conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  #propagate_down: false
}
layer {
  name: "flow_relu4_1"
  type: "ReLU"
  bottom: "flow_conv4_1"
  top: "flow_conv4_1"
}
layer {
  name: "flow_conv4_2"
  type: "Convolution"
  bottom: "flow_conv4_1"
  top: "flow_conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu4_2"
  type: "ReLU"
  bottom: "flow_conv4_2"
  top: "flow_conv4_2"
}
layer {
  name: "flow_conv4_3"
  type: "Convolution"
  bottom: "flow_conv4_2"
  top: "flow_conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu4_3"
  type: "ReLU"
  bottom: "flow_conv4_3"
  top: "flow_conv4_3"
}
layer {
  name: "flow_pool4"
  type: "Pooling"
  bottom: "flow_conv4_3"
  top: "flow_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "flow_conv5_1"
  type: "Convolution"
  bottom: "flow_pool4"
  top: "flow_conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3

  }
}
layer {
  name: "flow_relu5_1"
  type: "ReLU"
  bottom: "flow_conv5_1"
  top: "flow_conv5_1"
}
layer {
  name: "flow_conv5_2"
  type: "Convolution"
  bottom: "flow_conv5_1"
  top: "flow_conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu5_2"
  type: "ReLU"
  bottom: "flow_conv5_2"
  top: "flow_conv5_2"
}
layer {
  name: "flow_conv5_3"
  type: "Convolution"
  bottom: "flow_conv5_2"
  top: "flow_conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "flow_relu5_3"
  type: "ReLU"
  bottom: "flow_conv5_3"
  top: "flow_conv5_3"
}
layer {
  name: "flow_pool5"
  type: "Pooling"
  bottom: "flow_conv5_3"
  top: "flow_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "flow_fc6"
  type: "InnerProduct"
  bottom: "flow_pool5"
  top: "flow_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "flow_relu6"
  type: "ReLU"
  bottom: "flow_fc6"
  top: "flow_fc6"
}
layer {
  name: "flow_drop6"
  type: "Dropout"
  bottom: "flow_fc6"
  top: "flow_fc6"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "flow_fc7"
  type: "InnerProduct"
  bottom: "flow_fc6"
  top: "flow_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "flow_relu7"
  type: "ReLU"
  bottom: "flow_fc7"
  top: "flow_fc7"
}
layer {
  name: "flow_drop7"
  type: "Dropout"
  bottom: "flow_fc7"
  top: "flow_fc7"
  dropout_param {
    dropout_ratio: 0.8
  }
}
layer {
  name: "flow_fc8"
  type: "InnerProduct"
  bottom: "flow_fc7"
  top: "flow_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
	  std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "flow_loss"
  type: "SoftmaxWithLoss"
  bottom: "flow_fc8"
  bottom: "label"
  include {
    phase: TRAIN
  }
}
layer {
  name: "flow_loss"
  type: "SoftmaxWithLoss"
  bottom: "flow_fc8"
  bottom: "label"
  top: "flow_loss"
  include {
    phase: TEST
  }
}
layer {
  name: "flow_accuracy"
  type: "Accuracy"
  bottom: "flow_fc8"
  bottom: "label"
  top: "flow_accuracy"
  include {
    phase: TEST
  }
}
