name: "CUHK_Action_TemporalNet_COMBINE"
layer {
  name: "data"
  type: "VideoData"
  top: "data_pairs"
  top: "label"
  video_data_param {
    source: "dataset_file_examples/train_rgb_split1.txt"
    batch_size: 15
    new_width: 340
    new_height: 256
    new_length: 5
    num_segments: 1
    modality: RGB
    shuffle: true
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios: [1,.875,.75,.66]
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123]
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data_pairs"
  top: "label"
  video_data_param {
    source: "dataset_file_examples/val_rgb_split1.txt"
    batch_size: 5
    new_length: 5
    new_height: 256
    new_width: 340
    num_segments: 1
    modality: RGB
    
    full_test: false
    full_test_param {
      is_mirror: false
      is_crop: false
      full_test_num_segments: 25
      # in full test mode, you must set test_batch_size and batch_size is invalid
      test_batch_size: 5
    }
  }
  transform_param{
    crop_size: 224
    mirror: false
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123]
  }
  include: { phase: TEST }
}

layer {
  name: "slice_pair"
  type: "Slice"
  bottom: "data_pairs"
  top: "data_p0"
  top: "data_p1"
  top: "data_p2"
  top: "data_p3"
  top: "data_p4"
  slice_param {
    slice_dim: 1
    slice_point: 3
    slice_point: 6
    slice_point: 9
    slice_point: 12
  }
}

layer {
  name: "rgb5_conv1_1_p0"
  type: "Convolution"
  bottom: "data_p0"
  top: "rgb5_conv1_1_p0"
  param {
    name: "rgb5_conv1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_1_p0"
  type: "ReLU"
  bottom: "rgb5_conv1_1_p0"
  top: "rgb5_conv1_1_p0"
}



layer {
  name: "rgb5_conv1_1_p1"
  type: "Convolution"
  bottom: "data_p1"
  top: "rgb5_conv1_1_p1"
  param {
    name: "rgb5_conv1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_1_p1"
  type: "ReLU"
  bottom: "rgb5_conv1_1_p1"
  top: "rgb5_conv1_1_p1"
}




layer {
  name: "rgb5_conv1_1_p2"
  type: "Convolution"
  bottom: "data_p2"
  top: "rgb5_conv1_1_p2"
  param {
    name: "rgb5_conv1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_1_p2"
  type: "ReLU"
  bottom: "rgb5_conv1_1_p2"
  top: "rgb5_conv1_1_p2"
}





layer {
  name: "rgb5_conv1_1_p3"
  type: "Convolution"
  bottom: "data_p3"
  top: "rgb5_conv1_1_p3"
  param {
    name: "rgb5_conv1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_1_p3"
  type: "ReLU"
  bottom: "rgb5_conv1_1_p3"
  top: "rgb5_conv1_1_p3"
}








layer {
  name: "rgb5_conv1_1_p4"
  type: "Convolution"
  bottom: "data_p4"
  top: "rgb5_conv1_1_p4"
  param {
    name: "rgb5_conv1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_1_p4"
  type: "ReLU"
  bottom: "rgb5_conv1_1_p4"
  top: "rgb5_conv1_1_p4"
}









layer {
  name: "rgb5_conv1_1_minus1"
  type: "Eltwise"
  bottom: "rgb5_conv1_1_p0"
  bottom: "rgb5_conv1_1_p1"
  top: "rgb5_conv1_1_minus1"
  eltwise_param { 
    coeff: [-1, 1]
    operation: SUM 
  }
}
layer {
  name: "rgb5_conv1_1_minus2"
  type: "Eltwise"
  bottom: "rgb5_conv1_1_p1"
  bottom: "rgb5_conv1_1_p2"
  top: "rgb5_conv1_1_minus2"
  eltwise_param { 
    coeff: [-1, 1]
    operation: SUM 
  }
}
layer {
  name: "rgb5_conv1_1_minus3"
  type: "Eltwise"
  bottom: "rgb5_conv1_1_p2"
  bottom: "rgb5_conv1_1_p3"
  top: "rgb5_conv1_1_minus3"
  eltwise_param { 
    coeff: [-1, 1]
    operation: SUM 
  }
}
layer {
  name: "rgb5_conv1_1_minus4"
  type: "Eltwise"
  bottom: "rgb5_conv1_1_p3"
  bottom: "rgb5_conv1_1_p4"
  top: "rgb5_conv1_1_minus4"
  eltwise_param { 
    coeff: [-1, 1]
    operation: SUM 
  }
}
layer {
  name: "rgb5_concat_conv1_1minus"
  bottom: "rgb5_conv1_1_minus1"
  bottom: "rgb5_conv1_1_minus2"
  bottom: "rgb5_conv1_1_minus3"
  bottom: "rgb5_conv1_1_minus4"
  top: "rgb5_conv1_1_minus"
  type: "Concat"
  concat_param {
    axis: 1
  }
}


layer {
  name: "rgb5_conv1_2_minus"
  type: "Convolution"
  bottom: "rgb5_conv1_1_minus"
  top: "rgb5_conv1_2"
  param {
    name: "rgb5_conv1_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu1_2"
  type: "ReLU"
  bottom: "rgb5_conv1_2"
  top: "rgb5_conv1_2"
}
layer {
  name: "rgb5_pool1"
  type: "Pooling"
  bottom: "rgb5_conv1_2"
  top: "rgb5_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}



layer {
  name: "rgb5_conv2_1"
  type: "Convolution"
  bottom: "rgb5_pool1"
  top: "rgb5_conv2_1"
  param {
    name: "rgb5_conv2_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu2_1"
  type: "ReLU"
  bottom: "rgb5_conv2_1"
  top: "rgb5_conv2_1"
}
layer {
  name: "rgb5_conv2_2"
  type: "Convolution"
  bottom: "rgb5_conv2_1"
  top: "rgb5_conv2_2"
  param {
    name: "rgb5_conv2_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv2_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu2_2"
  type: "ReLU"
  bottom: "rgb5_conv2_2"
  top: "rgb5_conv2_2"
}
layer {
  name: "rgb5_pool2"
  type: "Pooling"
  bottom: "rgb5_conv2_2"
  top: "rgb5_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "rgb5_conv3_1"
  type: "Convolution"
  bottom: "rgb5_pool2"
  top: "rgb5_conv3_1"
  param {
    name: "rgb5_conv3_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv3_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu3_1"
  type: "ReLU"
  bottom: "rgb5_conv3_1"
  top: "rgb5_conv3_1"
}
layer {
  name: "rgb5_conv3_2"
  type: "Convolution"
  bottom: "rgb5_conv3_1"
  top: "rgb5_conv3_2"
  param {
    name: "rgb5_conv3_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv3_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu3_2"
  type: "ReLU"
  bottom: "rgb5_conv3_2"
  top: "rgb5_conv3_2"
}
layer {
  name: "rgb5_conv3_3"
  type: "Convolution"
  bottom: "rgb5_conv3_2"
  top: "rgb5_conv3_3"
  param {
    name: "rgb5_conv3_3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv3_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu3_3"
  type: "ReLU"
  bottom: "rgb5_conv3_3"
  top: "rgb5_conv3_3"
}
layer {
  name: "rgb5_pool3"
  type: "Pooling"
  bottom: "rgb5_conv3_3"
  top: "rgb5_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layer {
  name: "rgb5_conv4_1"
  type: "Convolution"
  bottom: "rgb5_pool3"
  top: "rgb5_conv4_1"
  param {
    name: "rgb5_conv4_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv4_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu4_1"
  type: "ReLU"
  bottom: "rgb5_conv4_1"
  top: "rgb5_conv4_1"
}
layer {
  name: "rgb5_conv4_2"
  type: "Convolution"
  bottom: "rgb5_conv4_1"
  top: "rgb5_conv4_2"
  param {
    name: "rgb5_conv4_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv4_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu4_2"
  type: "ReLU"
  bottom: "rgb5_conv4_2"
  top: "rgb5_conv4_2"
}
layer {
  name: "rgb5_conv4_3"
  type: "Convolution"
  bottom: "rgb5_conv4_2"
  top: "rgb5_conv4_3"
  param {
    name: "rgb5_conv4_3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv4_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu4_3"
  type: "ReLU"
  bottom: "rgb5_conv4_3"
  top: "rgb5_conv4_3"
}
layer {
  name: "rgb5_pool4"
  type: "Pooling"
  bottom: "rgb5_conv4_3"
  top: "rgb5_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "rgb5_conv5_1"
  type: "Convolution"
  bottom: "rgb5_pool4"
  top: "rgb5_conv5_1"
  param {
    name: "rgb5_conv5_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv5_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu5_1"
  type: "ReLU"
  bottom: "rgb5_conv5_1"
  top: "rgb5_conv5_1"
}
layer {
  name: "rgb5_conv5_2"
  type: "Convolution"
  bottom: "rgb5_conv5_1"
  top: "rgb5_conv5_2"
  param {
    name: "rgb5_conv5_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv5_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu5_2"
  type: "ReLU"
  bottom: "rgb5_conv5_2"
  top: "rgb5_conv5_2"
}
layer {
  name: "rgb5_conv5_3"
  type: "Convolution"
  bottom: "rgb5_conv5_2"
  top: "rgb5_conv5_3"
  param {
    name: "rgb5_conv5_3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "rgb5_conv5_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb5_relu5_3"
  type: "ReLU"
  bottom: "rgb5_conv5_3"
  top: "rgb5_conv5_3"
}
layer {
  name: "rgb5_pool5"
  type: "Pooling"
  bottom: "rgb5_conv5_3"
  top: "rgb5_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "rgb5_fc6"
  type: "InnerProduct"
  bottom: "rgb5_pool5"
  top: "rgb5_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb5_relu6"
  type: "ReLU"
  bottom: "rgb5_fc6"
  top: "rgb5_fc6"
}
layer {
  name: "rgb5_drop6"
  type: "Dropout"
  bottom: "rgb5_fc6"
  top: "rgb5_fc6"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "rgb5_fc7"
  type: "InnerProduct"
  bottom: "rgb5_fc6"
  top: "rgb5_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb5_relu7"
  type: "ReLU"
  bottom: "rgb5_fc7"
  top: "rgb5_fc7"
}
layer {
  name: "rgb5_drop7"
  type: "Dropout"
  bottom: "rgb5_fc7"
  top: "rgb5_fc7"
  dropout_param {
    dropout_ratio: 0.9
  }
}
# layer {
#   name: "rgb5_fc8_rgb"
#   type: "InnerProduct"
#   bottom: "rgb5_fc7"
#   top: "rgb5_fc8"
#   param {
#     lr_mult: 1
#     decay_mult: 1
#   }
#   param {
#     lr_mult: 2
#     decay_mult: 0
#   }
#   inner_product_param {
#     num_output: 101
#     weight_filler {
#       type: "gaussian"
#       std: 0.001
#     }
#     bias_filler {
#       type: "constant"
#       value: 0
#     }
#   }
# }






























layer {
  name: "rgb_conv1_1"
  type: "Convolution"
  bottom: "data_p2"
  top: "rgb_conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu1_1"
  type: "ReLU"
  bottom: "rgb_conv1_1"
  top: "rgb_conv1_1"
}
layer {
  name: "rgb_conv1_2"
  type: "Convolution"
  bottom: "rgb_conv1_1"
  top: "rgb_conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu1_2"
  type: "ReLU"
  bottom: "rgb_conv1_2"
  top: "rgb_conv1_2"
}
layer {
  name: "rgb_pool1"
  type: "Pooling"
  bottom: "rgb_conv1_2"
  top: "rgb_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv2_1"
  type: "Convolution"
  bottom: "rgb_pool1"
  top: "rgb_conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu2_1"
  type: "ReLU"
  bottom: "rgb_conv2_1"
  top: "rgb_conv2_1"
}
layer {
  name: "rgb_conv2_2"
  type: "Convolution"
  bottom: "rgb_conv2_1"
  top: "rgb_conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu2_2"
  type: "ReLU"
  bottom: "rgb_conv2_2"
  top: "rgb_conv2_2"
}
layer {
  name: "rgb_pool2"
  type: "Pooling"
  bottom: "rgb_conv2_2"
  top: "rgb_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv3_1"
  type: "Convolution"
  bottom: "rgb_pool2"
  top: "rgb_conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_1"
  type: "ReLU"
  bottom: "rgb_conv3_1"
  top: "rgb_conv3_1"
}
layer {
  name: "rgb_conv3_2"
  type: "Convolution"
  bottom: "rgb_conv3_1"
  top: "rgb_conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_2"
  type: "ReLU"
  bottom: "rgb_conv3_2"
  top: "rgb_conv3_2"
}
layer {
  name: "rgb_conv3_3"
  type: "Convolution"
  bottom: "rgb_conv3_2"
  top: "rgb_conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_3"
  type: "ReLU"
  bottom: "rgb_conv3_3"
  top: "rgb_conv3_3"
}
layer {
  name: "rgb_pool3"
  type: "Pooling"
  bottom: "rgb_conv3_3"
  top: "rgb_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv4_1"
  type: "Convolution"
  bottom: "rgb_pool3"
  top: "rgb_conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_1"
  type: "ReLU"
  bottom: "rgb_conv4_1"
  top: "rgb_conv4_1"
}
layer {
  name: "rgb_conv4_2"
  type: "Convolution"
  bottom: "rgb_conv4_1"
  top: "rgb_conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_2"
  type: "ReLU"
  bottom: "rgb_conv4_2"
  top: "rgb_conv4_2"
}
layer {
  name: "rgb_conv4_3"
  type: "Convolution"
  bottom: "rgb_conv4_2"
  top: "rgb_conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_3"
  type: "ReLU"
  bottom: "rgb_conv4_3"
  top: "rgb_conv4_3"
}
layer {
  name: "rgb_pool4"
  type: "Pooling"
  bottom: "rgb_conv4_3"
  top: "rgb_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv5_1"
  type: "Convolution"
  bottom: "rgb_pool4"
  top: "rgb_conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_1"
  type: "ReLU"
  bottom: "rgb_conv5_1"
  top: "rgb_conv5_1"
}
layer {
  name: "rgb_conv5_2"
  type: "Convolution"
  bottom: "rgb_conv5_1"
  top: "rgb_conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_2"
  type: "ReLU"
  bottom: "rgb_conv5_2"
  top: "rgb_conv5_2"
}
layer {
  name: "rgb_conv5_3"
  type: "Convolution"
  bottom: "rgb_conv5_2"
  top: "rgb_conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_3"
  type: "ReLU"
  bottom: "rgb_conv5_3"
  top: "rgb_conv5_3"
}
layer {
  name: "rgb_pool5"
  type: "Pooling"
  bottom: "rgb_conv5_3"
  top: "rgb_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_fc6"
  type: "InnerProduct"
  bottom: "rgb_pool5"
  top: "rgb_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb_relu6"
  type: "ReLU"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
}
layer {
  name: "rgb_drop6"
  type: "Dropout"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "rgb_fc7"
  type: "InnerProduct"
  bottom: "rgb_fc6"
  top: "rgb_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb_relu7"
  type: "ReLU"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
}
layer {
  name: "rgb_drop7"
  type: "Dropout"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
  dropout_param {
    dropout_ratio: 0.9
  }
}


layer {
  name: "concat_fc7"
  bottom: "rgb_fc7"
  bottom: "rgb5_fc7"
  top: "concat_fc7"
  type: "Concat"
  concat_param {
    axis: 1
  }
}


layer {
  name: "combine_fc8"
  type: "InnerProduct"
  bottom: "concat_fc7"
  top: "combine_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  propagate_down: false
}






layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "combine_fc8"
  bottom: "label"
  include {
    phase: TRAIN
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "combine_fc8"
  bottom: "label"
  top: "loss"
  include {
    phase: TEST
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "combine_fc8"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
