name: "rgb_CUHK_Action_TemporalNet"
layer {
  name: "rgb_data"
  type: "VideoData"
  top: "rgb_data"
  top: "rgb_label"
  video_data_param {
    source: "dataset_file_examples/train_rgb_split1.txt"
    batch_size: 50
    new_width: 340
    new_height: 256
    new_length: 1
    num_segments: 1
    modality: RGB
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios: [1,.875,.75,.66]
    mean_value: [104, 117, 123]
  }
  include: { phase: TRAIN }
}
layer {
  name: "rgb_data"
  type: "VideoData"
  top: "rgb_data"
  top: "rgb_label"
  video_data_param {
    source: "dataset_file_examples/val_rgb_split1.txt"
    batch_size: 5
    new_length: 1
    new_height: 256
    new_width: 340
    num_segments: 1
    modality: RGB
    
    full_test: false
    full_test_param {
      is_mirror: false
      is_crop: false
      full_test_num_segments: 25
      # in full test mode, you must set test_batch_size and batch_size is invalid
      test_batch_size: 5
    }
  }
  transform_param{
    crop_size: 224
    mirror: false
    mean_value: [104, 117, 123]
  }
  include: { phase: TEST }
}
layer {
  name: "rgb_conv1_1"
  type: "Convolution"
  bottom: "data_p2"
  top: "rgb_conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu1_1"
  type: "ReLU"
  bottom: "rgb_conv1_1"
  top: "rgb_conv1_1"
}
layer {
  name: "rgb_conv1_2"
  type: "Convolution"
  bottom: "rgb_conv1_1"
  top: "rgb_conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu1_2"
  type: "ReLU"
  bottom: "rgb_conv1_2"
  top: "rgb_conv1_2"
}
layer {
  name: "rgb_pool1"
  type: "Pooling"
  bottom: "rgb_conv1_2"
  top: "rgb_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv2_1"
  type: "Convolution"
  bottom: "rgb_pool1"
  top: "rgb_conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu2_1"
  type: "ReLU"
  bottom: "rgb_conv2_1"
  top: "rgb_conv2_1"
}
layer {
  name: "rgb_conv2_2"
  type: "Convolution"
  bottom: "rgb_conv2_1"
  top: "rgb_conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu2_2"
  type: "ReLU"
  bottom: "rgb_conv2_2"
  top: "rgb_conv2_2"
}
layer {
  name: "rgb_pool2"
  type: "Pooling"
  bottom: "rgb_conv2_2"
  top: "rgb_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv3_1"
  type: "Convolution"
  bottom: "rgb_pool2"
  top: "rgb_conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_1"
  type: "ReLU"
  bottom: "rgb_conv3_1"
  top: "rgb_conv3_1"
}
layer {
  name: "rgb_conv3_2"
  type: "Convolution"
  bottom: "rgb_conv3_1"
  top: "rgb_conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_2"
  type: "ReLU"
  bottom: "rgb_conv3_2"
  top: "rgb_conv3_2"
}
layer {
  name: "rgb_conv3_3"
  type: "Convolution"
  bottom: "rgb_conv3_2"
  top: "rgb_conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu3_3"
  type: "ReLU"
  bottom: "rgb_conv3_3"
  top: "rgb_conv3_3"
}
layer {
  name: "rgb_pool3"
  type: "Pooling"
  bottom: "rgb_conv3_3"
  top: "rgb_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv4_1"
  type: "Convolution"
  bottom: "rgb_pool3"
  top: "rgb_conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_1"
  type: "ReLU"
  bottom: "rgb_conv4_1"
  top: "rgb_conv4_1"
}
layer {
  name: "rgb_conv4_2"
  type: "Convolution"
  bottom: "rgb_conv4_1"
  top: "rgb_conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_2"
  type: "ReLU"
  bottom: "rgb_conv4_2"
  top: "rgb_conv4_2"
}
layer {
  name: "rgb_conv4_3"
  type: "Convolution"
  bottom: "rgb_conv4_2"
  top: "rgb_conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu4_3"
  type: "ReLU"
  bottom: "rgb_conv4_3"
  top: "rgb_conv4_3"
}
layer {
  name: "rgb_pool4"
  type: "Pooling"
  bottom: "rgb_conv4_3"
  top: "rgb_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_conv5_1"
  type: "Convolution"
  bottom: "rgb_pool4"
  top: "rgb_conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_1"
  type: "ReLU"
  bottom: "rgb_conv5_1"
  top: "rgb_conv5_1"
}
layer {
  name: "rgb_conv5_2"
  type: "Convolution"
  bottom: "rgb_conv5_1"
  top: "rgb_conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_2"
  type: "ReLU"
  bottom: "rgb_conv5_2"
  top: "rgb_conv5_2"
}
layer {
  name: "rgb_conv5_3"
  type: "Convolution"
  bottom: "rgb_conv5_2"
  top: "rgb_conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "rgb_relu5_3"
  type: "ReLU"
  bottom: "rgb_conv5_3"
  top: "rgb_conv5_3"
}
layer {
  name: "rgb_pool5"
  type: "Pooling"
  bottom: "rgb_conv5_3"
  top: "rgb_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "rgb_fc6"
  type: "InnerProduct"
  bottom: "rgb_pool5"
  top: "rgb_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb_relu6"
  type: "ReLU"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
}
layer {
  name: "rgb_drop6"
  type: "Dropout"
  bottom: "rgb_fc6"
  top: "rgb_fc6"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "rgb_fc7"
  type: "InnerProduct"
  bottom: "rgb_fc6"
  top: "rgb_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "rgb_relu7"
  type: "ReLU"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
}
layer {
  name: "rgb_drop7"
  type: "Dropout"
  bottom: "rgb_fc7"
  top: "rgb_fc7"
  dropout_param {
    dropout_ratio: 0.9
  }
}
layer {
  name: "rgb_fc8_rgb"
  type: "InnerProduct"
  bottom: "rgb_fc7"
  top: "rgb_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "rgb_loss"
  type: "SoftmaxWithLoss"
  bottom: "rgb_fc8"
  bottom: "rgb_label"
  include {
    phase: TRAIN
  }
}
layer {
  name: "rgb_loss"
  type: "SoftmaxWithLoss"
  bottom: "rgb_fc8"
  bottom: "rgb_label"
  top: "rgb_loss"
  include {
    phase: TEST
  }
}
layer {
  name: "rgb_accuracy"
  type: "Accuracy"
  bottom: "rgb_fc8"
  bottom: "rgb_label"
  top: "rgb_accuracy"
  include {
    phase: TEST
  }
}
